---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
source: html/bc5f0c34-05dc-1957-13bd-f1199e12ba97.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexStreamLine

A stream that can be used to write IndexLine
 primitives into an IndexBuffer

## Syntax (C#)
```csharp
public class IndexStreamLine : IndexStream
```